[M_Allium_ThanksgivingMission01 MissionDefinition]
MissionDescription="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler. Just find Torgue, and he'll explain how you're meant to survive this epic battle of meat and explosions."
TurnInDescription="Bon appétit!"
MissionSummary="Meet with Mister Torgue."

[M_Allium_ThanksgivingMission01:AddTheGravySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler. Just find Torgue, and he'll explain how you're meant to survive this epic battle of meat and explosions. First, though, you need to prepare a meal for the Gobbler that you can then poison. You've got the meat and the poison -- just poison some gravy and add it to the meat. Once that's done, you'll be ready to cook."

[M_Allium_ThanksgivingMission01:DefeatGobbler3 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>After cooking, grinding, poisoning, and running, the Wattle Gobbler is finally killable. Get in there and carve him up."

[M_Allium_ThanksgivingMission01:DefeatTribute1Set MissionObjectiveSetDefinition]
MissionSummaryOverride="Get the meat."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. Torgue has asked you to head to the kitchen and find some tasty meat."

[M_Allium_ThanksgivingMission01:FindJabberSurpriseTributeSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Defeat the tributes."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. With the meat grinded up, you need to find some poison. Torgue has recommended you find the Torgue Corporation stabber jabber nests and steal some of their poison glands. As of right now, however, you should probably worry about killing off the murderous tributes that Torgue Corporation President Smith sicced on you."

[M_Allium_ThanksgivingMission01:FindStabjackerNestsSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Get some poison."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. With the meat grinded up, you need to find some poison. Torgue has recommended you find the Torgue Corporation stabber jabber nests and steal some of their poison glands."

[M_Allium_ThanksgivingMission01:GameShowStartingSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler. Just find Torgue, and he'll explain how you're meant to survive this epic battle of meat and explosions.<br><br>First, you'll have to enter the Torgue broadcast set. Just hand in your admission ticket and you'll be free to enter."

[M_Allium_ThanksgivingMission01:GrabMeatSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Get the meat."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. Torgue has asked you to head to the kitchen and find some tasty meat."

[M_Allium_ThanksgivingMission01:HeadToKichenSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Head to the kitchen."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler. <br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. Torgue has asked you to head to the kitchen and find some tasty meat."

[M_Allium_ThanksgivingMission01:KillChefsSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Kill the chefs."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. Torgue has asked you to head to the kitchen and find some tasty meat.<br><br>Unfortunately, the Torgue corporation's chefs aren't psyched about the prospect of a Vault Hunter stealing their meat and cooking up a poison smorgasbord. You'll have to fight your way through them to get to the meat."

[M_Allium_ThanksgivingMission01:MoveMeatIntoPlaceSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Grind the meat."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. You've found some meat -- now it's time to grind it up and get the true meal ready."

[M_Allium_ThanksgivingMission01:PoisonGobblerSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride="Poison the Gobbler."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize."

[M_Allium_ThanksgivingMission01:PoisonTheGravySet MissionObjectiveSetDefinition]
MissionSummaryOverride="Poison the gravy."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler. Just find Torgue, and he'll explain how you're meant to survive this epic battle of meat and explosions. First, though, you need to prepare a meal for the Gobbler that you can then poison. You've got the meat and the poison -- just poison some gravy and add it to the meat. Once that's done, you'll be ready to cook."

[M_Allium_ThanksgivingMission01:SlagTheJackersSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. With the meat grinded up, you need to find some poison. Torgue has recommended you find the Torgue corporation stabber jabber nests and steal some of their poison glands.\nYou'll need to slag the jabbers, then kill them, then grab their glands.<br><br>Once that's done, you'll need to put the poison into some gravy -- the Gobbler ain't gonna eat poison all on its own."

[M_Allium_ThanksgivingMission01:StartFoodPreparationSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Defend the meal while it bakes."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. The meal's all ready, but you still have to cook it. You'll need to defend the oven while it bakes."

[M_Allium_ThanksgivingMission01:SurviveGobblerSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Survive the Gobbler's attacks."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>You poisoned the Gobbler, but it hasn't yet taken effect -- you'll have to survive long enough for your poison to really start working."

[M_Allium_ThanksgivingMission01:TakeFoodOutOfOvenSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Take food from oven."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. The meal is done cooking -- just take it out of the oven."

[M_Allium_ThanksgivingMission01:takeyourpositionset MissionObjectiveSetDefinition]
MissionSummaryOverride="Find the Wattle Gobbler."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize. For now, though, you just need to jump into an elevator and ascend to the [place]Grove of the Gobbler[-place]."

[M_Allium_ThanksgivingMission01:TalkToTorgueSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler. Just find Torgue, and he'll explain how you're meant to survive this epic battle of meat and explosions."

[M_Allium_ThanksgivingMission01:TributeDefeatedSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Get the meat."
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler.<br><br>Torgue has revealed to you that the Gobbler fight is rigged -- every previous contestant has died to the invincible (as in, like, actually invincible, not as in ''Crawmerax the Invincible'' where the ''invincible'' part was ironic) Wattle Gobbler.<br><br>Torgue needs you to poison the Gobbler to remove its invincibility. Once you've done that, you can kill it and collect your prize.<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. Torgue has asked you to head to the kitchen and find some tasty meat."

[M_Allium_ThanksgivingMission01:WatchTorgueShowSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mister Torgue has invited you to the Torgue corporation's ''Hunger For Violence Extravaganza'', where Pandora's badasses can test their mettle against the Ravenous Wattle Gobbler. Just find Torgue, and he'll explain how you're meant to survive this epic battle of meat and explosions.<br><br>Mister Torgue is currently broadcasting. You'll have to wait for him to finish his show before you can talk to him."
